1C_config/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1C_config/src/CommonModules/РаботаСAPI/Module.bsl
Функция ОбновитьКурсыВалют() Экспорт
    
    Попытка
        // Получаем данные с сайта ЦБ РФ
        Соединение = Новый HTTPСоединение("www.cbr.ru");
        Запрос = Новый HTTPЗапрос("/scripts/XML_daily.asp");
        Ответ = Соединение.Получить(Запрос);
        
        Если Ответ.КодСостояния <> 200 Тогда
            Возврат Ложь;
        КонецЕсли;
        
        ТекстXML = Ответ.ПолучитьТелоКакСтроку();
        
        // Читаем XML
        ЧтениеXML = Новый ЧтениеXML;
        ЧтениеXML.УстановитьСтроку(ТекстXML);
        
        // Проходим по всем элементам Valute
        Счетчик = 0;
        Пока ЧтениеXML.Прочитать() Цикл
            
            Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
                Продолжить;
            КонецЕсли;
            
            Если ЧтениеXML.Имя = "Valute" Тогда
                
                КодВалюты = "";
                КурсВалюты = 0;
                
                Пока ЧтениеXML.Прочитать() Цикл
                    
                    Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Valute" Тогда
                        Прервать;
                    КонецЕсли;
                    
                    Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
                        Продолжить;
                    КонецЕсли;
                    
                    Если ЧтениеXML.Имя = "CharCode" Тогда
                        ЧтениеXML.Прочитать();
                        Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
                            КодВалюты = ЧтениеXML.Значение;
                        КонецЕсли;
                    КонецЕсли;
                    
                    Если ЧтениеXML.Имя = "Value" Тогда
                        ЧтениеXML.Прочитать();
                        Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
                            СтрокаКурса = ЧтениеXML.Значение;
                            СтрокаКурса = СтрЗаменить(СтрокаКурса, ",", ".");
                            КурсВалюты = Число(СтрокаКурса);
                        КонецЕсли;
                    КонецЕсли;
                    
                КонецЦикла;
                
                // Ищем валюту в справочнике и сохраняем курс
                Если КодВалюты <> "" И КурсВалюты > 0 Тогда
                    Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
                    Если Не Валюта.Пустая() Тогда
                        
                        Запись = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
                        Запись.Период = ТекущаяДата();
                        Запись.Валюта = Валюта;
                        Запись.Курс = КурсВалюты;
                        Запись.Записать();
                        
                        Счетчик = Счетчик + 1;
                    КонецЕсли;
                КонецЕсли;
                
            КонецЕсли;
            
        КонецЦикла;
        
        ЧтениеXML.Закрыть();
        
        Если Счетчик > 0 Тогда
            Сообщить("Обновлено курсов: " + Счетчик);
            Возврат Истина;
        Иначе
            Возврат Ложь;
        КонецЕсли;
        
    Исключение
        Сообщить("Ошибка: " + ОписаниеОшибки());
        Возврат Ложь;
    КонецПопытки;
    
КонецФункции
